BAS BMEKZU Project/src/Documents/ПередачаМалоценныхАктивовВЭксплуатацию/ПередачаМалоценныхАктивовВЭксплуатацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаМалоценныхАктивовВЭксплуатацию</name>
  <comment>(Общ)</comment>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ЗатратыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВедомостьДвижений</registerRecords>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧерезКого</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпускРазрешил</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйЧленКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВторойЧленКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТретийЧленКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МалоценныеАктивы</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеИспользования</name>
      <type>
        <types>CatalogRef.НазначенияИспользования</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>КоличествоГолов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Поштучный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Поштучный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДополнительный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходнойПроводки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

BAS BMEKZU Project/src/InformationRegisters/ФИОФизическихЛиц/ФИОФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛицаОрганизаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>EnumRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/ВидыМалоценныхАктивов/ВидыМалоценныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМалоценныхАктивов</name>
  <enumValues>
    <name>МалоценныйБыстроизнашивающийсяПредмет</name>
  </enumValues>
  <enumValues>
    <name>МалоценныйНеоборотныйАктив</name>
  </enumValues>
  <enumValues>
    <name>БиблиотечныеФонды</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтветственныеЛицаОрганизаций</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйБухгалтер</name>
  </enumValues>
  <enumValues>
    <name>РуководительКадровойСлужбы</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаБухгалтерскиеРегистры</name>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_ГлавныйИнженер</name>
    <comment>ГлавныйИнженер</comment>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_СтаршийМастер</name>
    <comment>СтаршийМастер</comment>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_НачальникОхраны</name>
    <comment>Начальник охраны</comment>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_НачальникВТЛ</name>
    <comment>Начальник ВТЛ (зав. лабораторией)</comment>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_БухгалтерККУ</name>
    <comment>Бухгалтер ККУ</comment>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/НазначенияИспользования/НазначенияИспользования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НазначенияИспользования</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияРасходов</name>
    <type>
      <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМалоценногоАктива</name>
    <type>
      <types>EnumRef.ВидыМалоценныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПередачиБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизацииБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБУДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/Documents/ПередачаМалоценныхАктивовВЭксплуатацию/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет счета учета номенклатуры в строке табличной части документа
//
// Параметры:
//  ДанныеОбъекта         - структура данных объекта, используемых при заполнении счетов учета (вид операции,
//                          вид договора контрагента, признак комиссионной торговли и т.п.)
//  СтрокаТабличнойЧасти  - строка табличной части документа
//  ИмяТабличнойЧасти     - имя табличной части документа
//  СведенияОНоменклатуре - структура сведений о номенклатуре, либо стуктура счетов учета
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ДанныеОбъекта, СтрокаТабличнойЧасти, СведенияОНоменклатуре) Экспорт

	Если СведенияОНоменклатуре = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СведенияОНоменклатуре.Свойство("СчетаУчета") Тогда
		// СведенияОНоменклатуре - структура сведений номенклатуры
		СчетаУчета = СведенияОНоменклатуре.СчетаУчета;
	ИначеЕсли СведенияОНоменклатуре.Свойство("СчетУчетаБУ") Тогда
		// СведенияОНоменклатуре - структура счетов учета номенклатуры
		СчетаУчета = СведенияОНоменклатуре;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетаУчета.СчетУчетаБУ) Тогда
		СтрокаТабличнойЧасти.СчетУчетаБУ = СчетаУчета.СчетУчетаБУ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.НазначениеИспользования) Тогда
		
		Если СтрокаТабличнойЧасти.НазначениеИспользования.ВидМалоценногоАктива = Перечисления.ВидыМалоценныхАктивов.МалоценныйБыстроизнашивающийсяПредмет Тогда
			
			СтрокаТабличнойЧасти.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.МалоценныеИБыстроизнашивающиесяПредметыНаСкладе;
			
		Иначе                                      
			
			СтрокаТабличнойЧасти.СчетУчетаБУ = ПланыСчетов.Хозрасчетный.ПриобретениеДругихНеоборотныхМатериальныхАктивов;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Ведомость МШ-7
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МШ7";
	КомандаПечати.Представление = НСтр("ru='Ведомость МШ-7';uk='Відомість МШ-7'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	
	// Ведомость МШ-2
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МШ2";
	КомандаПечати.Представление = НСтр("ru='Ведомость МШ-2';uk='Відомість МШ-2'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	
	// Накладная M-11
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "М11";
	КомандаПечати.Представление = НСтр("ru='Накладная M-11';uk='Накладна M-11'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	
	// Форма ОЗ-1
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОЗ1";
	КомандаПечати.Представление = НСтр("ru='Форма ОЗ-1';uk='Форма ОЗ-1'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Передача малоценных активов в эксплуатацию""';uk='Реєстр документів ""Передача малоцінних активів в експлуатацію""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;
	
КонецПроцедуры

// Функция формирует табличный документ с типовой печатной формой ОЗ-1
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОЗ1(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ИмяМакета)
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВводВЭксплуатациюОС_ОЗ1";
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_UK_ОЗ1");
	
    ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл	
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
	
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка"           , Ссылка);
		Запрос.УстановитьПараметр("НаДату"           , Ссылка.МоментВремени());
		Запрос.УстановитьПараметр("Организация"      , Ссылка.Организация);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Дата                           КАК ДатаАкта,
		|	Док.Номер                          КАК НомерАкта,
		|	Док.Организация.НаименованиеПолное КАК Организация,
		|	Док.ПодразделениеОрганизации       КАК ПринялоПодразделение,
		|	ПРЕДСТАВЛЕНИЕ(Док.Склад)           КАК СдалоПодразделение,
		|	Док.Дата                           КАК ДатаВвода,
		|	Док.Организация.КодПоЕДРПОУ        КАК ЕДРПОУ
		|ИЗ
		|	Документ.ПередачаМалоценныхАктивовВЭксплуатацию КАК Док
		|ГДЕ 
		|	Док.Ссылка = &Ссылка
		|	";
		ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
		ВыборкаПоШапке.Следующий();

														
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка"         , Ссылка);
		Запрос.УстановитьПараметр("НаДату"         , Ссылка.Дата);
		Запрос.УстановитьПараметр("МоментДокумента", Ссылка.МоментВремени());
		Запрос.УстановитьПараметр("Организация"    , Ссылка.Организация);
		Запрос.УстановитьПараметр("Подразделение"  , Ссылка.ПодразделениеОрганизации);
		Запрос.УстановитьПараметр("СчетМЦ"         , ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации);
		
		МассивСубконто = Новый Массив;
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначенияИспользования);
		Запрос.УстановитьПараметр("Субконто", МассивСубконто);
		
		ВидМалоценногоАктива = Новый Массив;
		ВидМалоценногоАктива.Добавить(Перечисления.ВидыМалоценныхАктивов.МалоценныйНеоборотныйАктив);
		ВидМалоценногоАктива.Добавить(Перечисления.ВидыМалоценныхАктивов.БиблиотечныеФонды);
		Запрос.УстановитьПараметр("ВидМалоценногоАктива", ВидМалоценногоАктива);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.ФизЛицо.Код                                    КАК КодМОЛа,
		|	Док.ФизЛицо 									   КАК Получил, 
		|	Док.НазначениеИспользования.СчетБУДляПечати        КАК СчетДт,
		|	Док.СчетУчетаБУ                                    КАК СчетКт,
		|	Док.Номенклатура.НаименованиеПолное                КАК НаименованиеОС" + ?(Ссылка.Проведен, ",
		|	ВЫБОР
		|		КОГДА Хозрасчетный.КоличествоОборотДт = 0
		|			ТОГДА Хозрасчетный.СуммаОборот
		|		ИНАЧЕ Хозрасчетный.СуммаОборот / Хозрасчетный.КоличествоОборотДт
		|	КОНЕЦ                                              КАК ПервоначальнаяСтоимость", "") + "
		|ИЗ
		|	Документ.ПередачаМалоценныхАктивовВЭксплуатацию.МалоценныеАктивы КАК Док
		|		" + ?(Ссылка.Проведен, "
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|			                   &МоментДокумента,
		|			                   &МоментДокумента, , 
		|			                   СчетДт = &СчетМЦ,
		|			                   &Субконто, , , ) КАК Хозрасчетный
		|		ПО Док.ФизЛицо = Хозрасчетный.СубконтоДт1
		|			И Док.НазначениеИспользования = Хозрасчетный.СубконтоДт2", "") + "
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|	И Док.НазначениеИспользования.ВидМалоценногоАктива В(&ВидМалоценногоАктива)";
			
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Возврат ТабДокумент;
			
		КонецЕсли;
		
		ВыборкаПоКомиссии = ОбщегоНазначенияБПВызовСервера.ПолучитьСведенияОКомиссии(Ссылка);
		ВыборкаПоОС = Результат.Выбрать();
		
		ДанныеФизЛицаСдал = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Ссылка.Организация, Ссылка.Отпустил, Ссылка.Дата);
		ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(Ссылка.Организация, Ссылка.Дата);
		
		Пока ВыборкаПоОС.Следующий() Цикл

			ОбластьМакета = Макет.ПолучитьОбласть("ОЗ1");
			Параметры     = ОбластьМакета.Параметры;
			Параметры.Заполнить(ВыборкаПоШапке);
			Параметры.Заполнить(ВыборкаПоКомиссии);
			Параметры.Заполнить(ВыборкаПоОС);
			Параметры.ВидОперации = "Передача в експлуатацію";
			Параметры.Валюта      = ВалютаРегламентированногоУчета;
			
			ОбластьМакета.Параметры.СдалДолжность 	= ДанныеФизЛицаСдал.Должность;
			ОбластьМакета.Параметры.СдалФИО 		= ДанныеФизЛицаСдал.Представление;
			
			ДанныеФизЛицаПолучил = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Ссылка.Организация, ВыборкаПоОС.Получил, Ссылка.Дата);
			ОбластьМакета.Параметры.ПолучилДолжность 	= ДанныеФизЛицаПолучил.Должность;
			ОбластьМакета.Параметры.ПолучилФИО 			= ДанныеФизЛицаПолучил.Представление;
			
			ОбластьМакета.Параметры.ГлавныйБухгалтер 	= ОтветственныеЛица.ГлавныйБухгалтерПредставление;
			
			
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;	
		
	Возврат ТабДокумент;

КонецФункции // ПечатьОЗ1()

// Функция формирует печатную форму М-11
//
Функция ПечатьМ11(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ИмяМакета)
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПередачаМалоценныхАктивовВЭксплуатацию_М11";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_UK_М11");
	
    ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл	
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент"  , Ссылка);
		Запрос.УстановитьПараметр("НаДату"           , Ссылка.Дата);
		Запрос.УстановитьПараметр("Организация"      , Ссылка.Организация);
		Запрос.УстановитьПараметр("ЧерезКого"        , Ссылка.ЧерезКого);
		Запрос.УстановитьПараметр("ОтпускРазрешил"   , Ссылка.ОтпускРазрешил);
		Запрос.УстановитьПараметр("Отпустил"         , Ссылка.Отпустил);
		Запрос.УстановитьПараметр("ГлавныйБухгалтер" , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Номер                                                   КАК НомерДокумента,
		|	Док.Дата                                                    КАК ДатаДокумента,
		|	Док.Организация                                             КАК Организация,
		|	Док.Организация.НаименованиеПолное                          КАК ПредставлениеОрганизации,
		|	Док.Склад                                                   КАК Склад,
		|	ПРЕДСТАВЛЕНИЕ(Док.ПодразделениеОрганизации)                 КАК Подразделение,
		|	Док.Основание                                               КАК Основание,
		|	Док.Организация.КодПоЕДРПОУ                                 КАК КодПоЕДРПОУ,
		|	ФИОЧерезКого.Фамилия + "" ""
		|		+ ФИОЧерезКого.Имя + "" ""
		|		+ ФИОЧерезКого.Отчество                                 КАК ЧерезКого,
		|	ФИОЧерезКого.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОЧерезКого.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОЧерезКого.Отчество, 1, 1) + "".""        КАК ЧерезКогоФИО,
		|	ФИООтпускРазрешил.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИООтпускРазрешил.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИООтпускРазрешил.Отчество, 1, 1) + "".""   КАК ОтпускРазрешил,
		|	ФИООтпустил.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИООтпустил.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИООтпустил.Отчество, 1, 1) + "".""         КАК Отпустил,
		|	ФИОГлавныйБухгалтер.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер
		|ИЗ
		|	Документ.ПередачаМалоценныхАктивовВЭксплуатацию КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
		|			                &НаДату,
		|			                ФизическоеЛицо = &ЧерезКого) КАК ФИОЧерезКого
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
		|			                &НаДату,
		|			                ФизическоеЛицо = &ОтпускРазрешил) КАК ФИООтпускРазрешил
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
		|			                &НаДату,
		|			                ФизическоеЛицо = &Отпустил) КАК ФИООтпустил
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
		|		                    &НаДату,
		|		                    ФизическоеЛицо В
		|		                        (ВЫБРАТЬ
		|		                            ОтветственныеЛица.ФизическоеЛицо
		|		                        ИЗ
		|		                            РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|		                                            &НаДату,
		|		                                            СтруктурнаяЕдиница = &Организация
		|		                                            И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
		|		                    ) КАК ФИОГлавныйБухгалтер
		|		ПО (ИСТИНА)
		|ГДЕ
		|	Док.Ссылка = &ТекущийДокумент";

		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		                            
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
		Запрос.УстановитьПараметр("НаДату"         , Ссылка.Дата);
		Запрос.УстановитьПараметр("ВидМалоценногоАктива"   , Перечисления.ВидыМалоценныхАктивов.МалоценныйБыстроизнашивающийсяПредмет);
		
		СписокРаботников = Ссылка.МалоценныеАктивы.ВыгрузитьКолонку("ФизЛицо");
		ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(СписокРаботников);
		Запрос.УстановитьПараметр("СписокРаботников", СписокРаботников);
		
		Если Ссылка.Проведен Тогда
			
			Запрос.УстановитьПараметр("МоментДокумента", Ссылка.МоментВремени());
			Запрос.УстановитьПараметр("СчетМЦ"         , ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации);
			
			МассивСубконто = Новый Массив;
			МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);
			МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначенияИспользования);
			Запрос.УстановитьПараметр("Субконто", МассивСубконто);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ФИОКому.Фамилия + "" ""
			|		+ ФИОКому.Имя + "" ""
			|		+ ФИОКому.Отчество                                              КАК Кому,
			|	ФИОКому.Фамилия + "" ""
			|		+ ПОДСТРОКА(ФИОКому.Имя, 1, 1) + "". ""
			|		+ ПОДСТРОКА(ФИОКому.Отчество, 1, 1) + "".""                     КАК КомуФИО,
			|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное                     КАК МатериалНаименование,
			|	ВложенныйЗапрос.Номенклатура.Код                                    КАК НоменклатурныйНомер,
			|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
			|	ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения.Код            КАК ЕдиницаИзмеренияКод,
			|	ВложенныйЗапрос.СчетПередачиБУ                                      КАК СчетПередачи,
			|	ЕСТЬNULL(ВложенныйЗапрос.Количество, 0)                             КАК Количество,
			|	ВложенныйЗапрос.Цена                                                КАК Цена,
			|	ЕСТЬNULL(ВложенныйЗапрос.Стоимость, 0)                              КАК Стоимость
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт1 КАК Справочник.ФизическиеЛица)                          КАК Кому,
			|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт2 КАК Справочник.НазначенияИспользования).Владелец        КАК Номенклатура,
			|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт2 КАК Справочник.НазначенияИспользования).СчетБУДляПечати КАК СчетПередачиБУ,
			|		СУММА(Хозрасчетный.КоличествоОборотДт)                                                    КАК Количество,
			|		ВЫБОР
			|			КОГДА Хозрасчетный.КоличествоОборотДт = 0
			|				ТОГДА Хозрасчетный.СуммаОборот
			|			ИНАЧЕ ВЫРАЗИТЬ(Хозрасчетный.СуммаОборот / Хозрасчетный.КоличествоОборотДт КАК ЧИСЛО(15, 2))
			|		КОНЕЦ КАК Цена,
			|		СУММА(Хозрасчетный.СуммаОборот) КАК Стоимость
			|	ИЗ
			|		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
			|		                   &МоментДокумента,
			|		                   &МоментДокумента, , 
			|		                   СчетДт = &СчетМЦ,
			|		                   &Субконто, , , ) КАК Хозрасчетный
			|	ГДЕ
			|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт2 КАК Справочник.НазначенияИспользования).ВидМалоценногоАктива = &ВидМалоценногоАктива
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт1 КАК Справочник.ФизическиеЛица),
			|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт2 КАК Справочник.НазначенияИспользования).Владелец,
			|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоДт2 КАК Справочник.НазначенияИспользования).СчетБУДляПечати,
			|		ВЫБОР
			|			КОГДА Хозрасчетный.КоличествоОборотДт = 0
			|				ТОГДА Хозрасчетный.СуммаОборот
			|			ИНАЧЕ ВЫРАЗИТЬ(Хозрасчетный.СуммаОборот / Хозрасчетный.КоличествоОборотДт КАК ЧИСЛО(15, 2))
			|		КОНЕЦ
			|		) КАК ВложенныйЗапрос
			|		ЛЕВОЕ СОЕДИНЕНИЕ 
			|			РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
			|			                &НаДату,
			|			                ФизическоеЛицо В (&СписокРаботников)) КАК ФИОКому
			|		ПО ВложенныйЗапрос.Кому = ФИОКому.ФизическоеЛицо
			|ИТОГИ
			|	СУММА(Количество),
			|	СУММА(Стоимость)
			|ПО
			|	Кому";
			
		Иначе
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФИОКому.Фамилия + "" ""
			|		+ ФИОКому.Имя + "" ""
			|		+ ФИОКому.Отчество                                             КАК Кому,
			|	ФИОКому.Фамилия + "" ""
			|		+ ПОДСТРОКА(ФИОКому.Имя, 1, 1) + "". ""
			|		+ ПОДСТРОКА(ФИОКому.Отчество, 1, 1) + "".""                     КАК КомуФИО,
			|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное                     КАК МатериалНаименование,
			|	ВложенныйЗапрос.Номенклатура.Код                                    КАК НоменклатурныйНомер,
			|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
			|	ВложенныйЗапрос.ЕдиницаИзмерения.Код            КАК ЕдиницаИзмеренияКод,
			|	ВложенныйЗапрос.СчетПередачиБУ                                      КАК СчетПередачи,
			|	ЕСТЬNULL(ВложенныйЗапрос.Количество, 0)                             КАК Количество
			|ИЗ
			|	(ВЫБРАТЬ
			|		Док.ФизЛицо                                 КАК Кому,
			|		Док.Номенклатура                            КАК Номенклатура,
			|		Док.ЕдиницаИзмерения                        КАК ЕдиницаИзмерения,
			|		Док.НазначениеИспользования.СчетБУДляПечати КАК СчетПередачиБУ,
			|		СУММА(Док.Количество)                       КАК Количество
			|	ИЗ
			|		Документ.ПередачаМалоценныхАктивовВЭксплуатацию.МалоценныеАктивы КАК Док
			|	ГДЕ
			|		Док.Ссылка = &ТекущийДокумент
			|		И Док.НазначениеИспользования.ВидМалоценногоАктива = &ВидМалоценногоАктива
			|	                                                          
			|	СГРУППИРОВАТЬ ПО
			|		Док.ФизЛицо,
			|		Док.Номенклатура,
			|		Док.ЕдиницаИзмерения,
			|		Док.НазначениеИспользования.СчетБУДляПечати) КАК ВложенныйЗапрос
			|		ЛЕВОЕ СОЕДИНЕНИЕ 
			|			РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
			|			                &НаДату,
			|			                ФизическоеЛицо В (&СписокРаботников)) КАК ФИОКому
			|		ПО ВложенныйЗапрос.Кому = ФИОКому.ФизическоеЛицо
			|ИТОГИ
			|	СУММА(Количество)
			|ПО
			|	Кому";
			
		КонецЕсли;

		ЗапросПоНоменклатуре = Запрос.Выполнить();
		
		Если ЗапросПоНоменклатуре.Пустой() Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Возврат ТабДокумент;
			
		КонецЕсли;
		
		ВыборкаКому   = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		НеПервый      = Ложь;
		ЕстьЧерезКого = ЗначениеЗаполнено(Ссылка.ЧерезКого);
		ОбластьНомера = Макет.ПолучитьОбласть("Номера");
		
		Пока ВыборкаКому.Следующий()Цикл
			
			Если НеПервый Тогда
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЕсли;
			
			НеПервый = Истина;
			
			Область = Макет.ПолучитьОбласть("Шапка");
			Область.Параметры.Заполнить(Шапка);
			Область.Параметры.Кому = ВыборкаКому.Кому;
			Область.Параметры.КодОперации 	 = "Передача в експлуатацію";	
			Область.Параметры.Валюта      	 = ВалютаРегламентированногоУчета;
			
			ТабДокумент.Вывести(Область);
			ТабДокумент.Вывести(ОбластьНомера);
			
			ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
			ПараметрыПодвал = ОбластьПодвал.Параметры;
			ПараметрыПодвал.Заполнить(Шапка);
			
			Если Ссылка.Проведен Тогда
				
				ПрописьВалюты = ВалютаРегламентированногоУчета.ПараметрыПрописиНаУкраинском;
				ПараметрыПодвал.ИтогоСуммаПрописью = ЧислоПрописью(ВыборкаКому.Стоимость,
				"Л=uk_UA;ДП=Истина;", ПрописьВалюты);
				
			КонецЕсли;
			
			ВыборкаПоСтрокам = ВыборкаКому.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			КоличествоВВыборке     = ВыборкаПоСтрокам.Количество();
			КоличествоОбработанных = 1;
			// В форме сказано "Кількість найменувань". Будет выводится количество позиций.
			ПараметрыПодвал.ИтогоКоличествоПрописью = ЧислоПрописью(КоличествоВВыборке, 
			"Л=uk_UA;НП=Ложь;НД=Ложь;", ",,,,,,,,0");
			
			Пока ВыборкаПоСтрокам.Следующий() Цикл
				
				Область = Макет.ПолучитьОбласть("Строка");
				Область.Параметры.Заполнить(ВыборкаПоСтрокам);
				
				Если КоличествоОбработанных = КоличествоВВыборке Тогда
					// Последняя запись. Ее не следует отрывать от подписей.
					
					МассивТаблиц = Новый Массив(2);
					МассивТаблиц[0] = Область;
					МассивТаблиц[1] = ОбластьПодвал;
					
					Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
						
						ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						ТабДокумент.Вывести(ОбластьНомера);
						
					КонецЕсли;
					
				КонецЕсли;
				
				ТабДокумент.Вывести(Область);
				КоличествоОбработанных = КоличествоОбработанных + 1;
				КомуФИО                = ВыборкаПоСтрокам.КомуФИО;
				
			КонецЦикла;
			
			ПараметрыПодвал.Получил = ?(ЕстьЧерезКого, Шапка.ЧерезКогоФИО, КомуФИО);
			ТабДокумент.Вывести(ОбластьПодвал);
		
		КонецЦикла;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;	
		
	Возврат ТабДокумент;
	
КонецФункции // ПечатьМ11()

// Функция формирует печатную форму документа
//
Функция ПечатьМШ7(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ИмяМакета)
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПередачаМалоценныхАктивовВЭксплуатацию_МШ7";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_UK_МШ7");
	
	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл	
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент"  , Ссылка);
		Запрос.УстановитьПараметр("НаДату"           , Ссылка.Дата);
		Запрос.УстановитьПараметр("Организация"      , Ссылка.Организация);
		Запрос.УстановитьПараметр("МОЛ"              , Ссылка.Отпустил);
		Запрос.УстановитьПараметр("ГлавныйБухгалтер" , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Номер                                                   КАК НомерДокумента,
		|	Док.Дата                                                    КАК ДатаДокумента,
		|	Док.Организация                                             КАК Организация,
		|	Док.Организация.НаименованиеПолное                          КАК ПредставлениеОрганизации,
		|	Док.Склад                                                   КАК Склад,
		|	ПРЕДСТАВЛЕНИЕ(Док.ПодразделениеОрганизации)                 КАК Подразделение,
		|	Док.Организация.КодПоЕДРПОУ                                 КАК КодПоЕДРПОУ,
		|	ФИОМОЛ.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОМОЛ.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОМОЛ.Отчество, 1, 1) + "".""              КАК МОЛ,
		|	ФИОГлавныйБухгалтер.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер
		|ИЗ
		|	Документ.ПередачаМалоценныхАктивовВЭксплуатацию КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
		|			                &НаДату,
		|			                ФизическоеЛицо = &МОЛ) КАК ФИОМОЛ
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
		|		                    &НаДату,
		|		                    ФизическоеЛицо В
		|		                        (ВЫБРАТЬ
		|		                            ОтветственныеЛица.ФизическоеЛицо
		|		                        ИЗ
		|		                            РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|		                                            &НаДату,
		|		                                            СтруктурнаяЕдиница = &Организация
		|		                                И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
		|		                    ) КАК ФИОГлавныйБухгалтер
		|		ПО (ИСТИНА)
		|ГДЕ
		|	Док.Ссылка = &ТекущийДокумент";

		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	 	Запрос.УстановитьПараметр("ВидМалоценногоАктива"   , Перечисления.ВидыМалоценныхАктивов.МалоценныйБыстроизнашивающийсяПредмет);

		Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Номенклатура.Код                                    КАК НоменклатурныйНомер,
		|	Док.Номенклатура.НаименованиеПолное                     КАК МатериалНаименование,
		|	ПРЕДСТАВЛЕНИЕ(Док.ЕдиницаИзмерения) 					КАК ЕдиницаИзмеренияНаименование,
		|	Док.ЕдиницаИзмерения.Код            					КАК ЕдиницаИзмеренияКод,
		|	Док.Количество                                          КАК Количество,
		|	Док.ФизЛицо                                             КАК Сотрудник,
		//|	Док.ФизЛицо.Код                                         КАК ТабельныйНомер,
		|	Док.ДатаДокумента                                       КАК ДатаДокумента,
		|	Док.СрокСлужбы                                          КАК СрокСлужбы
		|ИЗ
		|	(ВЫБРАТЬ
		|		Док.Номенклатура                            КАК Номенклатура,
		|		Док.ЕдиницаИзмерения						КАК ЕдиницаИзмерения,
		|		СУММА(Док.Количество)                       КАК Количество,
		|		МИНИМУМ(Док.НомерСтроки) 		            КАК НомерСтроки,
		|		Док.ФизЛицо                                 КАК ФизЛицо,
		|		Док.Ссылка.Дата                             КАК ДатаДокумента,
		|		Док.НазначениеИспользования.СрокПолезногоИспользования КАК СрокСлужбы
		|	ИЗ
		|		Документ.ПередачаМалоценныхАктивовВЭксплуатацию.МалоценныеАктивы КАК Док
		|	ГДЕ
		|		Док.Ссылка = &ТекущийДокумент
		|		И Док.НазначениеИспользования.ВидМалоценногоАктива = &ВидМалоценногоАктива
		|
		|	СГРУППИРОВАТЬ ПО
		|		Док.Номенклатура,
		|		Док.ЕдиницаИзмерения,
		|		Док.ФизЛицо,
		|		Док.Ссылка.Дата,
		|		Док.НазначениеИспользования.СрокПолезногоИспользования) КАК Док
		|
		|УПОРЯДОЧИТЬ ПО НомерСтроки ВОЗР";

		ЗапросПоНоменклатуре = Запрос.Выполнить();

		Если ЗапросПоНоменклатуре.Пустой() Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Возврат ТабДокумент;
			
		КонецЕсли;
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.КодОперации 	 = "Передача в експлуатацію";	
			
		ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(Шапка);
		
		ТабДокумент.Вывести(Область);

		ВысотаШапки   = ТабДокумент.ВысотаТаблицы;
		ШиринаТаблицы = ТабДокумент.ШиринаТаблицы;
		ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область("R" + ВысотаШапки);
		ТабДокумент.ОбластьПечати            = ТабДокумент.Область("C2:C" + ШиринаТаблицы);
		
		ВыборкаПоСтрокам = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		КоличествоВВыборке     = ВыборкаПоСтрокам.Количество();
		КоличествоОбработанных = 1;
		
		СписокФизическихЛиц = Новый Массив;
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			СписокФизическихЛиц.Добавить(ВыборкаПоСтрокам.Сотрудник);
		КонецЦикла;	
		
		// ИНАГРО ++
		//ОсновныеСотрудникиФизическихЛиц = ИНАГРО_ОсновныеСотрудникиФизическихЛиц(СписокФизическихЛиц, Шапка.Организация, Шапка.ДатаДокумента);
		//СписокСотрудников = ОсновныеСотрудникиФизическихЛиц.ВыгрузитьКолонку("Сотрудник");
		//Если ЗначениеЗаполнено(СписокСотрудников) Тогда
		//	ДанныеФизЛица = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СписокСотрудников, "ФизическоеЛицо,ТабельныйНомер", Ссылка.Дата);
		//КонецЕсли;
		// ИНАГРО --
		
		ВыборкаПоСтрокам.Сбросить();
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл

			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(ВыборкаПоСтрокам);
			Область.Параметры.ДатаПоступления		= ВыборкаПоСтрокам.ДатаДокумента;
			Область.Параметры.НомерПП = КоличествоОбработанных;
			
			Область.Параметры.ТабельныйНомер		= "";
			// ИНАГРО ++
			//Если ДанныеФизЛица <> Неопределено Тогда
			//	СтрокаТЗ = ДанныеФизЛица.Найти(ВыборкаПоСтрокам.Сотрудник, "ФизическоеЛицо");
			//КонецЕсли;
			СтрокаТЗ = ИНАГРО_ЗарплатаКадрыРасширенный.ДанныеФизЛица(Ссылка.Организация, ВыборкаПоСтрокам.Сотрудник, Ссылка.Дата);  
			// ИНАГРО --
			
			Если СтрокаТЗ <> Неопределено Тогда
				Область.Параметры.ТабельныйНомер	= СтрокаТЗ.ТабельныйНомер;
			Иначе
				Сообщить(НСтр("ru='Проверте корректность ввода данных. Не является сотрудником компании - ';uk='Перевірте правильність введення даних. Не є співробітником компанії - '") 
							+ ВыборкаПоСтрокам.Сотрудник + "!", СтатусСообщения.Информация);
			КонецЕсли;
			Если КоличествоОбработанных = КоличествоВВыборке Тогда
				// Последняя запись. Ее не следует отрывать от подписей.
				
				МассивТаблиц = Новый Массив(2);
				МассивТаблиц[0] = Область;
				МассивТаблиц[1] = ОбластьПодвал;
				
				Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
					
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТабДокумент.Вывести(Область);
	        КоличествоОбработанных = КоличествоОбработанных + 1;

		КонецЦикла;

		// Вывод подвала
		ТабДокумент.Вывести(ОбластьПодвал);

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Ссылка);		
		КонецЦикла;	
		
	Возврат ТабДокумент;

КонецФункции // ПечатьМШ7()

// Функция формирует печатную форму документа
//
Функция ПечатьМШ2(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ИмяМакета)
	УстановитьПривилегированныйРежим(Истина);

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПередачаМалоценныхАктивовВЭксплуатацию_МШ2";
	
	// Вывод заголовка
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПередачаМалоценныхАктивовВЭксплуатацию.ПФ_MXL_UK_МШ2");
	
	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл	
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент"	, Ссылка);
		Запрос.УстановитьПараметр("НаДату"          , Ссылка.Дата);
		Запрос.УстановитьПараметр("Организация"     , Ссылка.Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПередачаМалоценныхАктивовВЭксплуатацию.Номер 	                      КАК НомерДокумента,
		|	ПередачаМалоценныхАктивовВЭксплуатацию.Дата	                       	  КАК ДатаДокумента,
		|	ПередачаМалоценныхАктивовВЭксплуатацию.Организация                    КАК Организация,
		|	ПередачаМалоценныхАктивовВЭксплуатацию.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
		|	ПередачаМалоценныхАктивовВЭксплуатацию.Склад                          КАК Склад,
		|	ПередачаМалоценныхАктивовВЭксплуатацию.Организация.КодПоЕДРПОУ    	  КАК КодПоЕДРПОУ,
		|	ПередачаМалоценныхАктивовВЭксплуатацию.ПодразделениеОрганизации 	  КАК ПредставлениеПодразделения
		|ИЗ
		|	Документ.ПередачаМалоценныхАктивовВЭксплуатацию КАК ПередачаМалоценныхАктивовВЭксплуатацию
		|
		|ГДЕ
		|	ПередачаМалоценныхАктивовВЭксплуатацию.Ссылка = &ТекущийДокумент";

		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	 	Запрос.УстановитьПараметр("ВидМалоценногоАктива"   , Перечисления.ВидыМалоценныхАктивов.МалоценныйБыстроизнашивающийсяПредмет);

		Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Номенклатура.Код КАК НоменклатурныйНомер,
		|	Док.Номенклатура.НаименованиеПолное КАК МатериалНаименование,
		|	Док.Количество КАК Количество,
		|	Док.ФизЛицо КАК Сотрудник,
		|	Док.ФизЛицо.Код КАК ТабельныйНомер,
		|	Док.ДатаДокумента КАК ДатаДокумента,
		|	Док.СрокСлужбы КАК СрокСлужбы
		|ИЗ
		|	(ВЫБРАТЬ
		|		Док.Номенклатура КАК Номенклатура,
		|		СУММА(Док.Количество) КАК Количество,
		|		МИНИМУМ(Док.НомерСтроки) КАК НомерСтроки,
		|		Док.ФизЛицо КАК ФизЛицо,
		|		Док.Ссылка.Дата КАК ДатаДокумента,
		|		Док.НазначениеИспользования.СрокПолезногоИспользования КАК СрокСлужбы
		|	ИЗ
		|		Документ.ПередачаМалоценныхАктивовВЭксплуатацию.МалоценныеАктивы КАК Док
		|	ГДЕ
		|		Док.Ссылка = &ТекущийДокумент
		|		И Док.НазначениеИспользования.ВидМалоценногоАктива = &ВидМалоценногоАктива
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Док.Номенклатура,
		|		Док.ФизЛицо,
		|		Док.Ссылка.Дата,
		|		Док.НазначениеИспользования.СрокПолезногоИспользования) КАК Док
		|
		|УПОРЯДОЧИТЬ ПО
		|	Док.НомерСтроки
		|ИТОГИ ПО
		|	Сотрудник";

		ЗапросПоНоменклатуре = Запрос.Выполнить();

		Если ЗапросПоНоменклатуре.Пустой() Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Возврат ТабДокумент;
			
		КонецЕсли;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Заполнить(Шапка);
		
		НеПервый                 = Ложь;
		
		ВыборкаСотрудники = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Пока ВыборкаСотрудники.Следующий() Цикл
			
			Если НеПервый Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				НеПервый = Истина;
			КонецЕсли;
			
			ВыборкаПоСтрокам = ВыборкаСотрудники.Выбрать();
		
			КоличествоВВыборке     = ВыборкаПоСтрокам.Количество();
			КоличествоОбработанных = 1;
			
			// ИНАГРО ++
			ДанныеСотрудника = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Ссылка.Организация, ВыборкаСотрудники.Сотрудник, Ссылка.Дата);
			ДополнительныеДанныеСотрудника = ИНАГРО_ЗарплатаКадрыРасширенный.ДанныеФизЛица(Ссылка.Организация, ВыборкаСотрудники.Сотрудник, Ссылка.Дата);   
			// ИНАГРО --
			
			ОбластьШапка.Параметры.Сотрудник 			= ДанныеСотрудника.Фамилия + " " + ДанныеСотрудника.Имя + " " + ДанныеСотрудника.Отчество;
			ОбластьШапка.Параметры.Должность 			= ДополнительныеДанныеСотрудника.Должность; // ИНАГРО ++
			
			ОбластьШапка.Параметры.ТабельныйНомер 		= ДополнительныеДанныеСотрудника.ТабельныйНомер; // ИНАГРО ++
		
			ТабДокумент.Вывести(ОбластьШапка);
			ВысотаШапки   = ТабДокумент.ВысотаТаблицы;
			ШиринаТаблицы = ТабДокумент.ШиринаТаблицы;
			ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область("R" + ВысотаШапки);
			ТабДокумент.ОбластьПечати            = ТабДокумент.Область("C2:C" + ШиринаТаблицы);
				
			Пока ВыборкаПоСтрокам.Следующий() Цикл

				Область = Макет.ПолучитьОбласть("Строка");
				Область.Параметры.Заполнить(ВыборкаПоСтрокам);
				Область.Параметры.МатериалНаименование = СокрЛП(ВыборкаПоСтрокам.МатериалНаименование);
				
				Если КоличествоОбработанных = КоличествоВВыборке Тогда
					// Последняя запись. Ее не следует отрывать от подписей.
					
					МассивТаблиц = Новый Массив(1);
					МассивТаблиц[0] = Область;
					
					Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
						
						ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						
					КонецЕсли;
					
				КонецЕсли;
				
				ТабДокумент.Вывести(Область);
				КоличествоОбработанных = КоличествоОбработанных + 1;

			КонецЦикла;
				
		КонецЦикла;		

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;	
	
	Возврат ТабДокумент;

КонецФункции // ПечатьМШ2()

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

	// Проверяем, нужно ли для макета формировать табличный документ.
	// Формируем табличный документ и добавляем его в коллекцию печатных форм.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МШ7") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МШ7", НСтр("ru='Ведомость МШ-7';uk='Відомість МШ-7'"),
			ПечатьМШ7(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ИмяМакета), , ИмяМакета);
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МШ2") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МШ2", НСтр("ru='Ведомость МШ-2';uk='Відомість МШ-2'"),
			ПечатьМШ2(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ИмяМакета), , ИмяМакета);
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М11") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "М11", НСтр("ru='Накладная M-11';uk='Накладна M-11'"),
			ПечатьМ11(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ИмяМакета), , ИмяМакета);
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОЗ1") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОЗ1", НСтр("ru='Форма ОЗ-1';uk='Форма ОЗ-1'"),
			ПечатьОЗ1(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ИмяМакета), , ИмяМакета);
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "ПодразделениеОрганизации");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
